In [1]:
import pandas as pd

In [2]:
#membuat series
pd.Series(data = [1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
#membuat dataframe
data = {"Nama" : ['Budi','Ani'],
        "Umur" : [12,13]}
df = pd.DataFrame(data)
df

   Nama  Umur
0  Budi    12
1   Ani    13

In [5]:
#mengubah index diatas
df1 = pd.DataFrame.from_dict(data, orient='index')
df1

         0    1
Nama  Budi  Ani
Umur    12   13

In [6]:
#mengubah index
df2 = pd.DataFrame.from_dict(data, orient='index', columns=['A','B'])
df2

         A    B
Nama  Budi  Ani
Umur    12   13

In [7]:
#mengubah index dengan cara lain
df2.columns = ['First','Second']
df2

     First Second
Nama  Budi    Ani
Umur    12     13

In [8]:
#mengakses nama kolom
df2.columns.values[0] #kolom pertama

'First'

In [9]:
#mengubah salah satu nama kolom
df2.columns.values[0] = "Satu"
df2

      Satu Second
Nama  Budi    Ani
Umur    12     13

## Exercixe 1

#### 1. Buat dataframe sesuai data berikut (umur, lokasi, nama)
#### 24, New York, John
#### 13, Paris, Anna
#### 53, Berlin, Peter

In [ ]:
data1 = pd.DataFrame({"Umur" : [24,13,53],
                      "Lokasi" : ['New York', 'Paris', 'Berlin'],
                      "Nama" : ['John', 'Anna', 'Peter']})
data1

#### 2. ubah lokasi menjadi kota

In [ ]:
data1.columns.values[1] = 'Kota'
data1

#### Batas Exercise 1

In [10]:
#Membuka file CSV
uber = pd.read_csv('My Uber Drives - 2016.csv') #File ada di folder yang sama 
uber

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [11]:
#Menampilkan 5 data pertama
uber.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [12]:
#Menampilkan 5 data terakhir
uber.tail()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [13]:
#Menampilkan bentuk data
uber.shape #(baris, kolom)

(1156, 7)

In [14]:
#Menampilkan tipe data
uber.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [15]:
data1 = pd.DataFrame({'Cost': ['5','5','7'],
                      'Amount' : [11,12,14],
                      'Date' : ['11-10-2020','13-10-2020','23-09-2020']})
data1

  Cost  Amount        Date
0    5      11  11-10-2020
1    5      12  13-10-2020
2    7      14  23-09-2020

In [16]:
data1.dtypes

Cost      object
Amount     int64
Date      object
dtype: object

In [17]:
#Mengubah tipe data object menjadi datetime
data1["Date"] = pd.to_datetime(data1["Date"])
data1.dtypes

Cost              object
Amount             int64
Date      datetime64[ns]
dtype: object

In [18]:
#mengubah tipe data object menjadi numeric
data1['Cost'] = pd.to_numeric(data1['Cost'])
data1.dtypes

Cost               int64
Amount             int64
Date      datetime64[ns]
dtype: object

In [19]:
uber.describe(include='all')

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
count,1156,1155,1155,1155,1155,1156.000000,653
unique,1155,1154,2,177,188,NaN,10
top,6/28/2016 23:34,6/28/2016 23:59,Business,Cary,Cary,NaN,Meeting
freq,2,2,1078,201,203,NaN,187
mean,NaN,NaN,NaN,NaN,NaN,21.115398,NaN
std,NaN,NaN,NaN,NaN,NaN,359.299007,NaN
min,NaN,NaN,NaN,NaN,NaN,0.500000,NaN
25%,NaN,NaN,NaN,NaN,NaN,2.900000,NaN
50%,NaN,NaN,NaN,NaN,NaN,6.000000,NaN
75%,NaN,NaN,NaN,NaN,NaN,10.400000,NaN
max,NaN,NaN,NaN,NaN,NaN,12204.700000,NaN

### Exercise 2

In [ ]:
data2 = {'Nama' : ['Ahmad', 'Joko', 'Adi'],
         'Umur' : ['12','13','15'],
         'Kelas' : [6,7,8]}
data3 = pd.DataFrame(data2)
data3.dtypes

In [ ]:
data3['Umur'] = pd.to_numeric(data3['Umur'])
data3.dtypes

In [ ]:
data = pd.read_csv('titanic.csv')
data

In [ ]:
data.head()

In [ ]:
data.tail()

In [ ]:
data.describe()

In [ ]:
data.shape

In [ ]:
data.info()

In [ ]:
data.size

#### batas exercise 2

In [20]:
#DATA MANIPULATION (Dataset UBER)
#Indexing
#iloc (indexing berdasarkan index)
uber.iloc[0:3, [1,3]] #[baris 0 s/d 3, kolom[1 dan 3]]

        END_DATE*       START*
0  1/1/2016 21:17  Fort Pierce
1   1/2/2016 1:37  Fort Pierce
2  1/2/2016 20:38  Fort Pierce

In [ ]:
uber.iloc[-10:, 3:6] #baris 10 terakhir, kolom 3 s/d 5

In [ ]:
uber.iloc[0:5, 3:6] #baris 0 s/d 4, kolom 3 s/d 5

In [ ]:
#loc (indexing berdasarkan isi data)
uber.loc[0:5, :"START*"] #baris 0 s/d 4, kolom 0 s/d START*

In [ ]:
uber.loc[:, ["START_DATE*","MILES*"]].head() #ambil data 5 teratas pada kolom START_DATE dan MILES

In [ ]:
uber.loc[:1154, ["START_DATE*","MILES*"]] #ambil data dari baris 0 s/d 1154 pada kolom START_DATE dan MILES

In [ ]:
a = uber.loc[:, "START*"] #ambil data semua baris pada kolom START dan dimasukkan dalam variabel (bentuk data series)
type(a)

In [ ]:
b = uber.loc[:, ["START*"]].head() #ambil 5 data teratas pada kolom START dan dimasukkan dalam variabel (bentuk data dataframe)
type(b)

### Exercise 3

In [ ]:
uber.loc[:, ["START_DATE*", "START*", "STOP*"]].head(11)

In [ ]:
uber.loc[:, ["START_DATE*", "START*", "STOP*"]].tail(11)

#### Batas exercise 3

In [ ]:
#FILTERING
uber.loc[uber["MILES*"] > 10, ["START*"]] #mengambil data di kolom START yang memiliki nilai dibawah 10

In [ ]:
uber.loc[uber["START*"] == 'New York'] #mengambil semua data yang memiliki kata kunci New York pada kolom START

In [ ]:
uber.loc[uber["START*"] == "New York", ["MILES*","STOP*"]] #mengambil data pada kolom MILES dan STOP berdasarkan kata kunci New York pada kolom START

In [ ]:
#Filtering dengan banyak kondisi
st = uber[uber["START*"].isin(["Cary", "New York"])]
st.head(10)

In [ ]:
#mengurutkan index
st.reset_index(inplace=True, drop=True)
st

In [ ]:
#SORTING
uber.sort_values(by=['MILES*','PURPOSE*'], ascending=False) #sorting data terbesar berdasarkan kolom MIlES dan PURPOSE

In [ ]:
uber.sort_values(by=['MILES*','PURPOSE*'], ascending=True) #sorting data terkecil berdasarkan kolom MIlES dan PURPOSE

In [ ]:
#Menambahkan kolom berdasarkan kondisi
import numpy as np

In [ ]:
uber["DISTANCE"] = np.where(uber["MILES*"] > 5, "Long Trip", "Short Trip") #(kondisi, true, false)
uber.head()

In [ ]:
uber["DISTANCE"].value_counts()

In [ ]:
#Menambakan kolom di belakang
uber["YEAR"] = np.array("2020")
uber.head()